tests/load/gui/smoke.yml
# Smoke Test Configuration - GUI
# Purpose: Quick validation that the UI is up and responding
# Duration: ~1 minute
# Usage: artillery run tests/load/gui/smoke.yml --config tests/load/gui/gui-flows.yml

config:
  target: "http://{{ $env.FRONTEND_IP }}:{{ $env.FRONTEND_PORT }}"
  
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Smoke test - GUI validation"
  
  processor: "../helpers/test-helpers.cjs"

  variables:
    username: "{{ $env.TEST_USER_USERNAME }}"
    password: "{{ $env.TEST_USER_PASS }}"
  
  engines:
    playwright: {}

  plugins:
    ensure:
      maxErrorRate: 1  # Max 1% error rate

  ensure:
    maxErrorRate: 1